Infineon/micropython-psoc-edge/ports/psoc-edge/machine_counter.c
// Increment/decrement cycles counter with 16-bit wrap semantics.
static inline void machine_counter_cycles_step(machine_counter_obj_t *self) {
    if (self->direction == COUNTER_DIR_DOWN) {
        self->cycles_u16--;
    } else {
        self->cycles_u16++;
    }
}

// Counter terminal-count ISR: track wrap events in software cycles.
static void machine_counter_isr(machine_counter_obj_t *self) {
    if (Cy_TCPWM_GetInterruptStatus(TCPWM0, self->counter_num) & CY_TCPWM_INT_ON_TC) {
        Cy_TCPWM_ClearInterrupt(TCPWM0, self->counter_num, CY_TCPWM_INT_ON_TC);
        machine_counter_cycles_step(self);
    }
}

// Generate one IRQ handler per Counter id for direct dispatch.
#define COUNTER_IRQ_HANDLER_DECL(id, counter, irq, pclk, trig) \
    static void machine_counter_irq_handler_##id(void) { \
        machine_counter_obj_t *self = counter_obj[id]; \
        if (self != NULL) { \
            machine_counter_isr(self); \
        } \
    }
MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_IRQ_HANDLER_DECL)
#undef COUNTER_IRQ_HANDLER_DECL

#define COUNTER_IRQ_HANDLER_ENTRY(id, counter, irq, pclk, trig) machine_counter_irq_handler_##id,
static const cy_israddress machine_counter_irq_handlers[MACHINE_COUNTER_NUM_INSTANCES] = {
    MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_IRQ_HANDLER_ENTRY)
};
#undef COUNTER_IRQ_HANDLER_ENTRY

// Roll back Counter state and release channel ownership after init failure.
static void machine_counter_init_fail_cleanup(machine_counter_obj_t *self) {
    machine_counter_stop_hw(self);
    machine_counter_stop_irq(self);
    machine_counter_restore_src_pin(self);
    self->configured = false;
    self->cycles_u16 = 0;
    self->offset = 0;

    machine_tcpwm_counter_free(self->counter_num, MP_OBJ_FROM_PTR(self));
    counter_obj[self->id] = NULL;
}

// Parse init args and configure routing, trigger mux, and TCPWM hardware.
static void machine_counter_init_helper_impl(machine_counter_obj_t *self,
    size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {

    enum {
        ARG_src,
        ARG_edge,
        ARG_direction,
        ARG_filter_ns,
        ARG_max,
        ARG_min,
        ARG_index,
        ARG_reset,
        ARG_match,
        ARG_match_pin,
    };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_src, MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_edge, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = COUNTER_EDGE_RISING} },
        { MP_QSTR_direction, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = COUNTER_DIR_UP} },
        { MP_QSTR_filter_ns, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_max, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_min, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_index, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_reset, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_match, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_match_pin, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args,
        MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    uint8_t edge = args[ARG_edge].u_int;
    if (edge != COUNTER_EDGE_RISING && edge != COUNTER_EDGE_FALLING) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid edge"));
    }

    uint8_t direction = args[ARG_direction].u_int;
    if (direction != COUNTER_DIR_UP && direction != COUNTER_DIR_DOWN) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid direction"));
    }

    mp_int_t filter_ns = args[ARG_filter_ns].u_int;
    if (filter_ns < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("filter_ns must be >= 0"));
    }
    if (filter_ns > 0) {
        mp_raise_NotImplementedError(MP_ERROR_TEXT("filter_ns not supported"));
    }

    mp_int_t min = args[ARG_min].u_int;
    if (min < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("min must be >= 0"));
    }

    if (args[ARG_index].u_obj != mp_const_none) {
        mp_raise_NotImplementedError(MP_ERROR_TEXT("index not supported"));
    }
    if (args[ARG_reset].u_obj != mp_const_none) {
        mp_raise_NotImplementedError(MP_ERROR_TEXT("reset not supported"));
    }
    if (args[ARG_match].u_obj != mp_const_none) {
        mp_raise_NotImplementedError(MP_ERROR_TEXT("match not supported"));
    }
    if (args[ARG_match_pin].u_obj != mp_const_none) {
        mp_raise_NotImplementedError(MP_ERROR_TEXT("match_pin not supported"));
    }

    uint32_t max_hw = machine_counter_period_max(self->counter_num);
    uint32_t range_max = max_hw;
    if (args[ARG_max].u_obj != mp_const_none) {
        mp_int_t max = mp_obj_get_int(args[ARG_max].u_obj);
        if (max < 0) {
            mp_raise_ValueError(MP_ERROR_TEXT("max must be >= 0"));
        }
        if (max == 0 && min == 0) {
            range_max = max_hw;
        } else if ((uint64_t)max > (uint64_t)max_hw) {
            mp_raise_ValueError(MP_ERROR_TEXT("max out of range"));
        } else {
            range_max = (uint32_t)max;
        }
    }

    if ((uint64_t)min >= (uint64_t)range_max) {
        mp_raise_ValueError(MP_ERROR_TEXT("min must be < max"));
    }

    uint32_t range_min = (uint32_t)min;
    uint32_t period = range_max - range_min;

    // Resolve source pin object and validate it exposes Counter input AF.
    mp_hal_pin_obj_t src_pin = mp_hal_get_pin_obj(args[ARG_src].u_obj);

    mp_hal_pin_af_config_t src_pin_af_config = MP_HAL_PIN_AF_CONF_INIT(src_pin, CY_GPIO_DM_HIGHZ, 0, MACHINE_PIN_AF_SIGNAL_PERI_TR_IO_INPUT);

    machine_pin_af_unit_t fn_unit = MACHINE_PIN_AF_UNIT_NONE;
    mp_hal_periph_pins_af_resolve_fn_unit(&src_pin_af_config, 1, MACHINE_PIN_AF_FN_PERI_TR_IO, &fn_unit);

    en_peri0_trig_input_debugreducation1_t in_trig = peri0_tr_io_input[fn_unit];

    // Tear down any previous run before programming new pin routing.
    machine_counter_stop_hw(self);
    machine_counter_stop_irq(self);
    machine_counter_restore_src_pin(self);

