Infineon/micropython-psoc-edge/ports/psoc-edge/machine_counter.c
    // Ensure shared timer clock is configured and bound to this counter PCLK.
    machine_counter_configure_clock();
    Cy_SysClk_PeriPclkAssignDivider(self->pclk_dst,
        CY_SYSCLK_DIV_16_BIT, CYBSP_GENERAL_PURPOSE_TIMER_CLK_DIV_NUM);

    mp_hal_periph_pins_af_init(&src_pin_af_config, 1);

    // Record the source pin now so rollback can restore it on any failure below.
    self->src_pin = src_pin;

    // Connect selected pin trigger line to this counter's dedicated trigger input.
    uint32_t out_trig = counter_out_trig[self->id];
    cy_en_trigmux_status_t mux_rslt = Cy_TrigMux_Connect(in_trig, out_trig, false, TRIGGER_TYPE_LEVEL);
    if (mux_rslt != CY_TRIGMUX_SUCCESS) {
        // Roll back pin mux state if trigger connect fails.
        machine_counter_restore_src_pin(self);
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("Counter route connect failed (0x%lx)"),
            (unsigned long)mux_rslt);
    }

    cy_stc_tcpwm_counter_config_t cfg = {0};
    cfg.period = period;
    cfg.clockPrescaler = CY_TCPWM_COUNTER_PRESCALER_DIVBY_1;
    cfg.runMode = CY_TCPWM_COUNTER_CONTINUOUS;
    cfg.countDirection = CY_TCPWM_COUNTER_COUNT_UP;
    cfg.compareOrCapture = CY_TCPWM_COUNTER_MODE_COMPARE;
    cfg.compare0 = 0;
    cfg.compare1 = 0;
    cfg.enableCompareSwap = false;
    cfg.interruptSources = CY_TCPWM_INT_ON_TC;
    cfg.captureInputMode = COUNTER_INPUT_DISABLED & 0x3U;
    cfg.captureInput = CY_TCPWM_INPUT_0;
    cfg.reloadInputMode = COUNTER_INPUT_DISABLED & 0x3U;
    cfg.reloadInput = CY_TCPWM_INPUT_0;
    cfg.startInputMode = COUNTER_INPUT_DISABLED & 0x3U;
    cfg.startInput = CY_TCPWM_INPUT_0;
    cfg.stopInputMode = COUNTER_INPUT_DISABLED & 0x3U;
    cfg.stopInput = CY_TCPWM_INPUT_0;
    cfg.countInputMode = (edge == COUNTER_EDGE_RISING) ? CY_TCPWM_INPUT_RISINGEDGE : CY_TCPWM_INPUT_FALLINGEDGE;
    // With TCPWM_TR_ONE_CNT_NR == 1 this selects one-to-one trigger input for this counter.
    cfg.countInput = CY_TCPWM_INPUT_TRIG_0;

    #if (CY_IP_MXTCPWM_VERSION >= 2U)
    cfg.capture1InputMode = COUNTER_INPUT_DISABLED & 0x3U;
    cfg.capture1Input = CY_TCPWM_INPUT_0;
    cfg.enableCompare1Swap = false;
    cfg.compare2 = CY_TCPWM_GRP_CNT_CC0_DEFAULT;
    cfg.compare3 = CY_TCPWM_GRP_CNT_CC0_BUFF_DEFAULT;
    cfg.trigger0Event = CY_TCPWM_CNT_TRIGGER_ON_DISABLED;
    cfg.trigger1Event = CY_TCPWM_CNT_TRIGGER_ON_DISABLED;
    #endif

    cy_en_tcpwm_status_t rslt = Cy_TCPWM_Counter_Init(TCPWM0, self->counter_num, &cfg);
    if (rslt != CY_TCPWM_SUCCESS) {
        machine_counter_restore_src_pin(self);
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("Counter(%u) init failed (PDL error 0x%lx)"),
            (unsigned)self->id, (unsigned long)rslt);
    }

    Cy_TCPWM_Counter_SetCounter(TCPWM0, self->counter_num, 0);
    Cy_TCPWM_ClearInterrupt(TCPWM0, self->counter_num, CY_TCPWM_INT_ON_TC);

    self->irq_cfg.priority = SYS_INT_IRQ_LOWEST_PRIORITY;
    self->irq_cfg.handler = machine_counter_irq_handlers[self->id];
    sys_int_init(&self->irq_cfg);
    self->irq_active = true;

    Cy_TCPWM_Counter_Enable(TCPWM0, self->counter_num);
    Cy_TCPWM_TriggerReloadOrIndex_Single(TCPWM0, self->counter_num);

    self->edge = edge;
    self->direction = direction;
    self->range_min = range_min;
    self->range_max = range_max;
    self->cycles_u16 = 0;
    self->offset = 0;
    self->configured = true;
}

// Wrapper that enforces identical rollback semantics for constructor and init().
static void machine_counter_init_helper(machine_counter_obj_t *self,
    size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {

    nlr_buf_t nl;
    if (nlr_push(&nl) == 0) {
        machine_counter_init_helper_impl(self, n_args, pos_args, kw_args);
        nlr_pop();
    } else {
        machine_counter_init_fail_cleanup(self);
        nlr_jump(nl.ret_val);
    }
}

// ---------------------------------------------------------------------------
// Constructor: Counter(id, ...)
// ---------------------------------------------------------------------------

// Create a Counter object, reserve hardware, and run optional init.
static mp_obj_t machine_counter_make_new(const mp_obj_type_t *type,
    size_t n_args, size_t n_kw, const mp_obj_t *args) {

    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    mp_int_t id = mp_obj_get_int(args[0]);
    if (id < 0 || id >= MACHINE_COUNTER_NUM_INSTANCES) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("Counter id must be in range 0-%d"),
            MACHINE_COUNTER_NUM_INSTANCES - 1);
    }

    if (counter_obj[id] != NULL) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("Counter(%u) already created."), (unsigned)id);
    }

    machine_counter_obj_t *self = mp_obj_malloc(machine_counter_obj_t, &machine_counter_type);
    counter_obj[id] = self;

    self->id = (uint8_t)id;
    self->counter_num = counter_hw[id];
    self->pclk_dst = machine_tcpwm_counter_pclk(self->counter_num);
    self->src_pin = NULL;
    self->edge = COUNTER_EDGE_RISING;
    self->direction = COUNTER_DIR_UP;
    self->range_min = 0;
    self->range_max = machine_counter_period_max(self->counter_num);
    self->cycles_u16 = 0;
    self->offset = 0;
    self->irq_cfg.irq_num = counter_irq[id];
    self->irq_active = false;
    self->configured = false;

    nlr_buf_t nl;
    if (nlr_push(&nl) == 0) {
        machine_tcpwm_counter_alloc(self->counter_num, MP_OBJ_FROM_PTR(self));
        nlr_pop();
    } else {
        counter_obj[id] = NULL;
        nlr_jump(nl.ret_val);
    }

    if (n_args > 1 || n_kw > 0) {
        mp_map_t kw_map;
        mp_map_init_fixed_table(&kw_map, n_kw, args + n_args);
        machine_counter_init_helper(self, n_args - 1, args + 1, &kw_map);
    }

    return MP_OBJ_FROM_PTR(self);
}

// ---------------------------------------------------------------------------
// counter.init(src, *, edge=, direction=)
// ---------------------------------------------------------------------------

// Python binding for Counter.init(...).
static mp_obj_t machine_counter_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    machine_counter_init_helper(MP_OBJ_TO_PTR(args[0]), n_args - 1, args + 1, kw_args);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_counter_init_obj, 1, machine_counter_init);

// ---------------------------------------------------------------------------
// counter.deinit()
// ---------------------------------------------------------------------------

// Python binding for Counter.deinit().
static mp_obj_t machine_counter_deinit(mp_obj_t self_in) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(self_in);

    machine_counter_stop_hw(self);
    machine_counter_stop_irq(self);
    machine_counter_restore_src_pin(self);

    self->configured = false;
    self->cycles_u16 = 0;
    self->offset = 0;

    machine_tcpwm_counter_free(self->counter_num, MP_OBJ_FROM_PTR(self));
    counter_obj[self->id] = NULL;

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_counter_deinit_obj, machine_counter_deinit);

