Infineon/micropython-psoc-edge/ports/psoc-edge/machine_counter.c
// Module-level lifecycle called from machine_deinit().
void machine_counter_deinit_all(void) {
    for (uint8_t i = 0; i < MACHINE_COUNTER_NUM_INSTANCES; i++) {
        machine_counter_obj_t *self = counter_obj[i];
        if (self != NULL) {
            machine_counter_deinit(MP_OBJ_FROM_PTR(self));
        }
    }
}

// ---------------------------------------------------------------------------
// counter.value([value])
// ---------------------------------------------------------------------------

// Return current count, or reset logical origin when a value is provided.
static mp_obj_t machine_counter_value(size_t n_args, const mp_obj_t *args) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (!self->configured) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("not initialised"));
    }

    if (n_args == 2) {
        // Freeze counting during read/reset so no new edges arrive in this window.
        Cy_TCPWM_Counter_Disable(TCPWM0, self->counter_num);
    }

    uint32_t raw = Cy_TCPWM_Counter_GetCounter(TCPWM0, self->counter_num);
    uint64_t span = (uint64_t)(self->range_max - self->range_min) + 1ULL;
    int16_t cycles = machine_counter_cycles_get(self);
    long long edge_total;
    if (self->direction == COUNTER_DIR_DOWN) {
        edge_total = (long long)(-cycles) * (long long)span + (long long)raw;
        edge_total = -edge_total;
    } else {
        edge_total = (long long)cycles * (long long)span + (long long)raw;
    }
    long long result = (long long)self->offset + edge_total;

    if (n_args == 2) {
        self->offset = mp_obj_get_int(args[1]);
        self->cycles_u16 = 0;
        Cy_TCPWM_Counter_SetCounter(TCPWM0, self->counter_num, 0);
        Cy_TCPWM_ClearInterrupt(TCPWM0, self->counter_num, CY_TCPWM_INT_ON_TC);
        Cy_TCPWM_Counter_Enable(TCPWM0, self->counter_num);
        Cy_TCPWM_TriggerReloadOrIndex_Single(TCPWM0, self->counter_num);
    }

    return mp_obj_new_int_from_ll(result);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_counter_value_obj, 1, 2, machine_counter_value);

// ---------------------------------------------------------------------------
// counter.cycles([value])
// ---------------------------------------------------------------------------

// Get or set the signed 16-bit software cycles counter.
static mp_obj_t machine_counter_cycles(size_t n_args, const mp_obj_t *args) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (!self->configured) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("not initialised"));
    }

    int16_t prev = machine_counter_cycles_get(self);

    if (n_args == 2) {
        mp_int_t value = mp_obj_get_int(args[1]);
        if (value < -32768 || value > 32767) {
            mp_raise_ValueError(MP_ERROR_TEXT("cycles out of range"));
        }
        self->cycles_u16 = (uint16_t)(int16_t)value;
    }

    return mp_obj_new_int(prev);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_counter_cycles_obj, 1, 2, machine_counter_cycles);

// Print user-facing representation as Counter(<id>).
static void machine_counter_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(self_in);
    const char *edge_str = (self->edge == COUNTER_EDGE_FALLING) ? "FALLING" : "RISING";
    const char *dir_str = (self->direction == COUNTER_DIR_DOWN) ? "DOWN" : "UP";

    if (self->src_pin == NULL) {
        mp_printf(print, "Counter(id=%u, src=None, edge=Counter.%s, direction=Counter.%s)",
            (unsigned)self->id, edge_str, dir_str);
    } else {
        mp_printf(print, "Counter(id=%u, src=%q, edge=Counter.%s, direction=Counter.%s)",
            (unsigned)self->id, self->src_pin->name, edge_str, dir_str);
    }
}

static const mp_rom_map_elem_t machine_counter_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_counter_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&machine_counter_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_value), MP_ROM_PTR(&machine_counter_value_obj) },
    { MP_ROM_QSTR(MP_QSTR_cycles), MP_ROM_PTR(&machine_counter_cycles_obj) },

    { MP_ROM_QSTR(MP_QSTR_RISING), MP_ROM_INT(COUNTER_EDGE_RISING) },
    { MP_ROM_QSTR(MP_QSTR_FALLING), MP_ROM_INT(COUNTER_EDGE_FALLING) },
    { MP_ROM_QSTR(MP_QSTR_UP), MP_ROM_INT(COUNTER_DIR_UP) },
    { MP_ROM_QSTR(MP_QSTR_DOWN), MP_ROM_INT(COUNTER_DIR_DOWN) },
};
static MP_DEFINE_CONST_DICT(machine_counter_locals_dict, machine_counter_locals_dict_table);

MP_DEFINE_CONST_OBJ_TYPE(
    machine_counter_type,
    MP_QSTR_Counter,
    MP_TYPE_FLAG_NONE,
    make_new, machine_counter_make_new,
    print, machine_counter_print,
    locals_dict, &machine_counter_locals_dict
    );
